# Массивы (списки):

mylist = ["apple", "banana", "cherry"]
print(type(mylist)) # <class 'list'>

'''
Это один из 4-х встроенных типов данных, используются для хранения наборов данных.

Элементы списка имеют индексы: 
от 0 до len(list)-1 (если слева направо)
от -1 до -len(list) (если справа налево)

Свойства списков:
1. Элементы в них упорядочены (пронумерованы).
2. Список является изменяемым типом данных -
мы можем изменять, добавлять и удалять элементы из списка после его создания.
3. Элементы в списке могут повторяться.
4. Элементы списка могут быть любого типа данных.
'''

