"""Веб: https://3.shkolkovo.online/my/course/7259/materials/lesson/34244"""

# 1 КРАСИВЫЙ МЕТОД
'''
На вход программы поступает число N и последовательность из N целых положительных чисел.
Рассматриваются все пары различных элементов последовательности
(элементы пары не обязаны стоять в последовательности рядом, порядок элементов в паре неважен).
Необходимо определить пару с максимальной четной суммой элементов.
'''

# f = open("../Файлы к задачам/2__t1mf.txt")
# n = int(f.readline()) # считываем кол-во чисел
# a = [int(i) for i in f]
#
# me = mo = ms = 0 # me - макс чет; mo - макс нечет; ms - макс сумм
# for i in range(n-1):
#     if (a[i] > me) and (a[i] % 2 == 0): # ищем макс чет число
#         me = a[i]
#     if (a[i] > mo) and (a[i] % 2 != 0): # ищем макс нечет число
#         mo = a[i]
#     if a[i+1] % 2 == 0: # ищем чет сумму с след элементом
#         if ms < me + a[i+1]: # сравниваем с макс суммой
#             ms = me + a[i+1]
#     if a[i+1] % 2 != 0: # ищем чет сумму с след элементом
#         if ms < mo + a[i+1]: # сравниваем с макс суммой
#             ms = mo + a[i+1]
# print(ms)
# # 19996


# 1.1
'''
На вход программы поступает число N и последовательность из N целых положительных чисел.
Рассматриваются все пары различных элементов последовательности
(элементы пары не обязаны стоять в последовательности рядом, порядок элементов в паре неважен).
Необходимо определить количество пар, для которых сумма элементов чётна.
'''

# f = open("../Файлы к задачам/2__t1mf.txt")
# n = int(f.readline()) # считываем кол-во чисел
# a = [int(i) for i in f]
#
# me = mo = mr = 0 # me - чет; mo - нечет; mr - кол-во пар
# for i in range(n-1):
#     if a[i] % 2 == 0:
#         me += 1
#     if a[i] % 2 != 0:
#         mo += 1
#     if a[i+1] % 2 == 0:
#         mr += me
#     if a[i+1] % 2 != 0:
#         mr += mo
# print(mr)
# # 24996296


# 2
'''
Имеется набор данных, состоящий из положительных целых чисел.
Необходимо найти наибольшее произведение двух элементов, с разными номерами, кратное 10.
Гарантируется, что хотя бы одно такое произведение в последовательности есть.
Программа должна напечатать одно число — максимально возможное произведение,
которое соответствует условиям задачи.
'''

# f = open("../Файлы к задачам/Задание_27_A__f6wd__swpb.txt")
# n = int(f.readline())
# a = [int(i) for i in f]
#
# mx = m2 = m5 = m10 = mp = 0
# for i in range(n-1):
#     if a[i] > mx:
#         mx = a[i]
#     if (a[i] > m2) and (a[i] % 2 == 0):
#         m2 = a[i]
#     if (a[i] > m5) and (a[i] % 5 == 0):
#         m5 = a[i]
#     if (a[i] > m10) and (a[i] % 10 == 0):
#         m10 = a[i]
#     if (mx*a[i+1] > mp) and (mx*a[i+1] % 10 == 0):
#         mp = mx*a[i+1]
#     if (m2*a[i+1] > mp) and (m2*a[i+1] % 10 == 0):
#         mp = m2*a[i+1]
#     if (m5*a[i+1] > mp) and (m5*a[i+1] % 10 == 0):
#         mp = m5*a[i+1]
#     if (m10*a[i+1] > mp) and (m10*a[i+1] % 10 == 0):
#         mp = m10*a[i+1]
# print(mp)
# # 943800


# 3
'''
На вход подается число N, а затем последовательность из N натуральных чисел.
Напишите программу, которая находит минимальную четную сумму двух элементов последовательности,
стоящих на расстоянии не меньше 3, то есть |i−j| ≥ 3, где i != j - номера элементов последовательности.
В первой строке файла находится число N, в следующих N строках даны элементы последовательности,
целые положительные числа. Гарантируется, что искомую сумму получить можно.
'''

# f = open("../Файлы к задачам/20_A__4iej7.txt")
# n = int(f.readline())
# a = [int(i) for i in f]
# me = mo = ms = 10**10
# for i in range(n-3):
#     if (a[i] < me) and (a[i] % 2 == 0):
#         me = a[i]
#     if (a[i] < mo) and (a[i] % 2 != 0):
#         mo = a[i]
#     if (me + a[i+3] < ms) and ((me + a[i+3]) % 2 == 0):
#         ms = me + a[i+3]
#     if (mo + a[i+3] < ms) and ((mo + a[i+3]) % 2 == 0):
#         ms = mo + a[i+3]
# print(ms)
# # 20


# ДЗ к вебу:


# 1
# f = open("../Файлы к задачам/B__7jba6.txt")
# n = int(f.readline())
# a = [int(i) for i in f]
# m1 = m3 = mp = 0
# for i in range(n-1):
#     if a[i] % 3 == 0:
#         m3 += 1
#     if a[i]:
#         m1 += 1
#     if a[i+1] % 3 == 0:
#         mp += m1
#     if a[i+1] % 3 != 0:
#         mp += m3
# print(mp)
# # файл А - 2249; файл В - 1004583330


# 2
# f = open("../Файлы к задачам/A__7jbaa.txt")
# n = int(f.readline())
# a = [int(i) for i in f]
# m1 = m3 = m9 = mp = 0
#
# for i in range(n-1):
#     if a[i]:
#         m1 += 1
#
#     if a[i] % 9 == 0:
#         m9 += 1
#     elif a[i] % 3 == 0:
#         m3 += 1
#
#     if a[i+1] % 9 != 0:
#         mp += m9
#     if a[i+1] % 9 == 0:
#         mp += m1
#     elif a[i+1] % 3 == 0:
#         mp += m3
#
# print(mp)
# # файл А - 1045; файл В - 13089068


# 3
# f = open("../Файлы к задачам/27-2b__2zntw.txt")
# n = int(f.readline())
# a = [int(i) for i in f]
# m1 = m21 = m7 = m3 = mv = 0
# for i in range(n-1):
#     if a[i] > m1:
#         m1 = a[i]
#     if a[i] % 3 == 0 and a[i] % 7 != 0 and a[i] > m3:
#         m3 = a[i]
#     if a[i] % 7 == 0 and a[i] % 3 != 0 and a[i] > m7:
#         m7 = a[i]
#     if a[i] % 21 == 0 and a[i] > m21:
#         m21 = a[i]
#
#     if a[i+1] % 3 != 0 and a[i+1] % 7 != 0 and (m21 * a[i+1]) > mv:
#         mv = m21 * a[i+1]
#     if a[i+1] % 3 == 0 and a[i+1] % 7 != 0 and (m7 * a[i+1]) > mv:
#         mv = m7 * a[i+1]
#     if a[i+1] % 3 != 0 and a[i+1] % 7 == 0 and (m3 * a[i+1]) > mv:
#         mv = m3 * a[i+1]
#     if a[i+1] % 21 == 0 and (m1 * a[i+1]) > mv:
#         mv = m1 * a[i+1]
# print(mv)
# # файл А - 2031918; файл В - 2062095


# 4
# f = open("../Файлы к задачам/4__t7qm.txt")
# n = int(f.readline())
# a = [int(i) for i in f]
# m0 = m1 = m2 = mp = 0
#
# for i in range(n-1):
#     if a[i] % 3 == 0:
#         m0 += 1
#     if a[i] % 3 == 1:
#         m1 += 1
#     if a[i] % 3 ==2:
#         m2 += 1
#
#     if a[i+1] % 3 == 0:
#         mp += m0
#     if a[i+1] % 3 == 1:
#         mp += m2
#     if a[i+1] % 3 == 2:
#         mp += m1
# print(mp)
# # 16663756


# 5
# f = open("../Файлы к задачам/3_A__4i7tl.txt")
# n = int(f.readline())
# a = [int(i) for i in f]
# m1 = m2 = m4 = m8 = mp = 0
#
# for i in range(n-8):
#     if a[i]:
#         m1 += 1
#
#     if a[i] % 8 == 0:
#         m8 += 1
#     elif a[i] % 4 == 0:
#         m4 += 1
#     elif a[i] % 2 == 0:
#         m2 += 1
#
#     if a[i+8] % 8 != 0:
#         mp += m8
#     if a[i+8] % 8 == 0:
#         mp += m1
#     elif a[i+8] % 4 == 0:
#         mp += m2
#     elif a[i+8] % 2 == 0:
#         mp += m4
#
# print(mp)
# # файл А - 33; файл В - 1484498418