"""
Конспект по вебу: https://3.shkolkovo.online/my/course/7259/materials/lesson/36568
+ дз: https://3.shkolkovo.online/my/course/7259/dz/27118
+ веб: https://3.shkolkovo.online/my/course/7259/materials/lesson/38265
+ дз: https://3.shkolkovo.online/my/course/7259/dz/31128
"""

# 1
'''
---------------------------------------------------------------------------------------------------
Сеть задана IP-адресом узла 113.116.181.173 и маской сети 255.255.255.128.
Сколько в этой сети IP-адресов, которые оканчиваются на четыре одинаковых бита?
---------------------------------------------------------------------------------------------------

from ipaddress import *

net = ip_network('113.116.181.173/255.255.255.128', 0)
c = 0

for i in net:
    adr = bin(int(i))[2:].zfill(32)
    adr_end = adr[-4:]
    if adr_end in ['0000', '1111']:
        c += 1
print(c)
# 16
'''

# 2
'''
---------------------------------------------------------------------------------------------------
Сеть задана IP-адресом узла 142.206.189.107 и сетевой маской 255.255.192.0.
Сколько в этой сети IP-адресов, для которых количество единиц в двоичной записи IP-адреса кратно 3,
а сами адреса в двоичном виде заканчиваются на 1010?
---------------------------------------------------------------------------------------------------

from ipaddress import *

net = ip_network('142.206.189.107/255.255.192.0', 0)

c = 0
for i in net:
    adr = bin(int(i))[2:].zfill(32)
    if adr.count('1') % 3 == 0:
        if adr[-4:] == '1010':
            c += 1
print(c)
# 341
'''

# 3
'''
---------------------------------------------------------------------------------------------------
Сеть задана IP-адресом 44.249.80.224 и маской сети 255.255.255.252.
Сколько в этой сети узлов, для которых количество единиц в двоичной записи IP-адреса больше 14?
---------------------------------------------------------------------------------------------------

from ipaddress import *

net = ip_network('44.249.80.224/255.255.255.252', 0)
c = 0

for i in net.hosts():
    adr = bin(int(i))[2:].zfill(32)
    if adr.count('1') > 14:
        c += 1
print(c)
# 2
'''

# 4
'''
---------------------------------------------------------------------------------------------------
Определите номер компьютера в сети, если маска подсети равна 255.255.255.248 и
IP-адрес компьютера в сети 108.23.252.178
---------------------------------------------------------------------------------------------------

from ipaddress import *

net = ip_network('108.23.252.178/255.255.255.248', 0)
ip = ip_address('108.23.252.178')
print(int(ip) - int(net.network_address))
# 2
'''

# 5
'''
---------------------------------------------------------------------------------------------------
Определите номер компьютера в сети, если маска подсети равна 255.255.248.0 и
IP-адрес компьютера в сети 17.100.13.33.
---------------------------------------------------------------------------------------------------

from ipaddress import *

net = ip_network('17.100.13.33/255.255.248.0', 0)
ip = ip_address('17.100.13.33')
num = int(ip) - int(net.network_address)
print(num)
# 1313
'''


# 6
'''
---------------------------------------------------------------------------------------------------
По заданным IP-адресу и маске определите адрес сети:
IP-адрес: 183.228.100.169 Маска: 255.240.0.0
В ответе укажите полный адрес сети в десятичной системе счисления (без точек).
---------------------------------------------------------------------------------------------------
from ipaddress import *

net = ip_network("183.228.100.169/255.240.0.0", 0)
adr = str(net.network_address)

print(adr.replace(".", ""))
# 18322400
'''


# 7
'''
---------------------------------------------------------------------------------------------------
Узлы с IP-адресами 114.91.57.39 и 114.91.19.61 находятся в одной сети.
Укажите наименьшее возможное количество принадлежащих этой сети IP-адресов,
в двоичной записи которых чётное число единиц.
---------------------------------------------------------------------------------------------------
'''
# from ipaddress import *
#
# ip1 = ip_address('114.91.57.39')
# ip2 = ip_address('114.91.19.61')
#
# # поиск маски с наибольшим количеством единиц (=18)
# # for i in range(32):
# #     nt = ip_network('114.91.57.39/' + str(i), 0)
# #     if ip2 in nt:
# #         print(i)
# ans = 0
# n = ip_network('144.91.57.39/18', 0)
# for i in n:
#     if bin(int(i))[2:].zfill(32).count('1') % 2 == 0:
#         ans += 1
# print(ans)
# # 8192


# 18 марта (веб: https://3.shkolkovo.online/my/course/7259/materials/lesson/38265)

# 1
'''
---------------------------------------------------------------------------------------------------
Сеть задана IP-адресом 192.168.32.160 и маской сети 255.255.255.240.
Сколько в этой сети IP-адресов, для которых сумма единиц в двоичной записи IP-адреса чётна?
---------------------------------------------------------------------------------------------------
'''
# # На бумаге поняли, что последние 4 разряда в маске - нули -> в ip там либо 1, либо 0.
# # Количество единиц ip левее = 8. Следовательно, нужно посчитать, сколько четверок с чет кол-вом единиц.
# from itertools import *
#
# ans = 0
# for i in product('01', repeat=4):
#     g = ''.join(i)
#     if str(g).count('1') % 2 == 0:
#         ans += 1
# print(ans)


# 2
'''
---------------------------------------------------------------------------------------------------
Для узла с IP-адресом 1.100.224.252 адрес сети равен 1.100.224.0.
Для скольких различных значений маски это возможно?
---------------------------------------------------------------------------------------------------
'''
# from ipaddress import *
#
# net = ip_network('1.100.224.0')
#
# ans = 0
# for i in range(32):
#     nt = ip_network('1.100.224.252/' + str(i), 0)
#     if '1.100.224.0' == str(nt)[:-3]:
#         ans += 1
# print(ans)
# # 6


# 18 марта (ДЗ к вебу: https://3.shkolkovo.online/my/course/7259/dz/27832)

# 1
# from ipaddress import *
#
# net = ip_network('167.66.136.176/255.254.0.0', 0)
#
# mn = 10**10
# for i in net.hosts():
#     mn = min(mn, sum(int(k) for k in str(i).split('.')))
# print(mn)
# # 234


# 2
# print(int('11011000000000', 2))
# # 13824


# 3
# from ipaddress import *
#
# net = ip_network('112.208.0.0/255.255.248.0', 0)
# ans = 0
# for ip in net:
#     l = bin(int(ip))[2:].zfill(32)
#     if l[-4:].count('0') == 0 or l[-4:].count('1') == 0:
#         ans += 1
# print(ans)
# # 256


# 4
# from ipaddress import *
#
# ip = ip_address('135.120.117.213')
# net = ip_network('135.120.117.192')
#
# msk = []
# for i in range(32):
#     nt = ip_network('135.120.117.213/' + str(i), 0)
#     if '135.120.117.192' == str(nt)[:-3]:
#         msk.append(i)
# m = max(msk)
#
# nnt = ip_network('135.120.117.213/' + str(m), 0)
# ans = 0
# for i in nnt:
#     ans += 1
# print(ans)
# # 32


# 5
# from ipaddress import *
#
# ip = ip_address('149.127.136.165')
# net = ip_network('149.127.136.160')
#
# msk = []
# for i in range(32):
#     nt = ip_network('149.127.136.165/' + str(i), 0)
#     if '149.127.136.160' == str(nt)[:-3]:
#         msk.append(i)
# m = max(msk)
#
# nnt = ip_network('149.127.136.165/' + str(m), 0)
# ans = 0
# for i in nnt:
#     ans += 1
# print(ans)
# # 8


# 6
# from ipaddress import *
# print(ip_network('90.146.86.168/255.255.224.0', 0))
# # 90.146.64.0


# 7
# from ipaddress import *
#
# net = ip_network('68.232.57.148/255.255.252.0', 0)
# n = str(net)[:-3]
# q = n.split('.')
# t = [bin(int(i))[2:].zfill(8) for i in q]
# nt = ''.join(t)
# print(nt.count('0'))
# # 23


# 8
# from ipaddress import *
#
# msk = []
# for i in range(32):
#     nt = ip_network('14.253.13.6/' + str(i), 0)
#     if '14.253.0.0' == str(nt)[:-3]:
#         msk.append(i)
#
# ans = []
# for k in range(len(msk)):
#     net = ip_network('14.253.13.6/' + str(msk[k]), 0)
#     mx = 0
#     for i in net.hosts():
#         ip = bin(int(i))[2:].zfill(32)
#         mx = max(mx, ip.count('1'))
#     ans.append(mx)
# print(max(ans))
# # 25


# 9
# from ipaddress import *
#
# msk = []
# for i in range(32):
#     nt = ip_network('145.46.8.250/' + str(i), 0)
#     if '145.46.0.0' == str(nt)[:-3]:
#         msk.append(i)
#
# ans = []
# for k in range(len(msk)):
#     net = ip_network('145.46.8.250/' + str(msk[k]), 0)
#     mx = 0
#     for i in net.hosts():
#         ip = bin(int(i))[2:].zfill(32)
#         mx = max(mx, ip.count('1'))
#     ans.append(mx)
# print(max(ans))
# # 23


# ----------------------------------------------------------------------------------------------------------------------
'''https://3.shkolkovo.online/my/course/7259/dz/31128'''

# 1
# from ipaddress import *
#
# net = ip_network('186.215.243.5/255.255.192.0', 0)
#
# for ip in net.hosts():
#     print(ip)
# # 186.215.255.254


# 2
# from ipaddress import *
#
# ip_add = ip_address('162.115.138.246')
# net = ip_address('255.255.240.0')
# print(int(ip_add) - int(net))


# 4
# from ipaddress import *
#
# net = ip_network('10.18.134.17/255.255.255.128', 0)
# ans = 0
# for ip in net.hosts():
#     ans += 1
# print(ans)
# # 126


# 5
# from ipaddress import *
#
# # ip = ip_address('200.14.152.118')
# # for i in range(32, 0, -1):
# #     net_i = ip_network('200.14.152.118/' + str(i), 0)
# #     print(net_i, net_i.netmask)
#
# # i = 28 или i = 29
#
# net = ip_network('200.14.152.118/29', 0)
# ans = 0
# for ip in net:
#     ans += 1
# print(ans)
# # i = 28: ans = 16, i = 29: ans = 8
# # 8


# 6
# from ipaddress import *
#
# # for i in range(32):
# #     net = ip_network('108.212.62.110/' + str(i), 0)
# #     print(net, net.netmask)
# # i = 26
#
# net = ip_network('108.212.62.110/26', 0)
# ans = 0
# for ip in net:
#     ans += 1
# print(ans)
# # 64


'-----------------------------------------------------------------------------------------------------------------------'
'''https://3.shkolkovo.online/my/course/7259/dz/25859'''

# 1
# from ipaddress import *
# net = ip_network('188.134.59.77/255.255.255.192', 0)
# ip = ip_address('188.134.59.77')
# num = int(ip) - int(net.network_address)
# print(num)
# # ВТОРОЕ РЕШЕНИЕ (БОЛЕЕ ПОНЯТНОЕ)
# # num = 0
# # for i in net.hosts():
# #     num += 1
# #     if i == ip:
# #         print(num)
# # 13

# ----------------------------------------------------------------------------------------------------------------------

# 2
# from ipaddress import *
# net = ip_network('145.125.105.101/255.255.248.0', 0)
# ip = ip_address('145.125.105.101')
# # num = int(ip) - int(net.network_address)
# # print(num)
# # ВТОРОЕ РЕШЕНИЕ (БОЛЕЕ ПОНЯТНОЕ)
# num = 0
# for i in net.hosts():
#     num += 1
#     if i == ip:
#         print(num)
# # 13

# ----------------------------------------------------------------------------------------------------------------------

# 3
# from ipaddress import *
# ip = ip_address('7.120.112.5')
# # Поиск маски:
# for i in range(32):
#     net = ip_network('7.120.112.5/' + str(i), 0)
#     net2 = ip_network('7.120.96.0')
#     if net.network_address == net2.network_address:
#         print(i)
# # i = 19
# our_net = ip_network('7.120.112.5/19', 0)
# # num = int(ip) - int(our_net.network_address)
# # print(num)
# num = 0
# for l in our_net.hosts():
#     num += 1
#     if l == ip:
#         print(num)
# # 4101

# ----------------------------------------------------------------------------------------------------------------------

# 4
# from ipaddress import *
# ip = ip_address('10.43.180.188')
# net0 = ip_network('10.43.180.0')
#
# # for i in range(32):
# #     net = ip_network('10.43.180.188/' + str(i), 0)
# #     if net.network_address == net0.network_address:
# #         print(i) # i == 22; 23; 24
#
# # i = 22 -> 1024
# n = ip_network('10.43.180.188/22', 0)
# ans = 0
# for adr in n:
#     ans += 1
# print(ans)
# # 1024
#
# # i = 23 -> 512
# n = ip_network('10.43.180.188/23', 0)
# ans = 0
# for adr in n:
#     ans += 1
# print(ans)
# # 512
#
# # i = 24 -> 256
# n = ip_network('10.43.180.188/24', 0)
# ans = 0
# for adr in n:
#     ans += 1
# print(ans)
# # 256
#
# # 1024 256

# ----------------------------------------------------------------------------------------------------------------------

# 5
# from ipaddress import *
# print(bin(int(ip_network('68.232.57.148/255.255.252.0', 0).network_address))[2:].zfill(32).count('0'))
# # 23

# ----------------------------------------------------------------------------------------------------------------------

# 6
# from ipaddress import *
# net = ip_network('158.202.220.40/255.255.192.0', 0)
# print(net.network_address)
# # 158.202.192.0

# ----------------------------------------------------------------------------------------------------------------------

# 7
# from ipaddress import *
# net = ip_network('164.90.174.208/255.255.224.0', 0)
# print(net.network_address)
# # 164.90.160.0

# ----------------------------------------------------------------------------------------------------------------------

# 8
# from ipaddress import *
# ip = ip_address('215.119.119.160')
# net0 = ip_network('215.119.119.128')
#
# ans = []
# for i in range(32):
#     net = ip_network('215.119.119.160/' + str(i), 0)
#     if net.network_address == net0.network_address:
#         ans.append(i)
# print(max(ans))
# # 26

# ----------------------------------------------------------------------------------------------------------------------

# 9
# from ipaddress import *
# ip = ip_address('115.200.200.27')
# net0 = ip_network('115.200.192.0')
#
# for i in range(32):
#     net = ip_network('115.200.200.27/' + str(i), 0)
#     if net.network_address == net0.network_address:
#         print(i)
# # 11111111.11111111.11000000.00000000 <- i = 18
# print(int('11000000', 2))

# ----------------------------------------------------------------------------------------------------------------------

# 10
# from ipaddress import *
# ip = ip_address('128.225.157.50')
# net0 = ip_network('128.225.128.0')
#
# for i in range(32):
#     net = ip_network('128.225.157.50/' + str(i), 0)
#     if net.network_address == net0.network_address:
#         print(i)
# # 11111111.11111111.11100000.00000000 <- i = 19
# print(int('11100000', 2))
# # 224