"""
Решение ДЗ к вебу https://3.shkolkovo.online/my/course/7259/materials/lesson/34220
+ конспект к вебу: https://3.shkolkovo.online/my/course/7259/materials/lesson/36569
+ дз к вебу: https://3.shkolkovo.online/my/course/7259/dz/27119"""

# 1
'''
from re import *
f = open("24__7h55c.txt")
s = f.readline()

pattern = r'B[1-6]+([-*][1-6]+)+'
mx = 0
for i in finditer(pattern, s):
    res = i.group()
    mx = max(mx, len(res))
print(mx)
# 68
'''

# 3
'''
from re import *
f = open("Задание_24__7blrn.txt")
s = f.readline()

pattern = r'([A-D]*[1-9]+[0-9]*[A-D]*[0-9]*[2, 4, 6, 8, 0, A, C]+|[1-9]+[0-9]*[A-D]*[0-9]*[2, 4, 6, 8, 0, A, C]+)'
mx = 0
for i in finditer(pattern, s):
    res = i.group()
    mx = max(mx, len(res))
print(mx)
# 2598
'''

# 4
'''
from re import *
f = open("demo_2025_24__7ae4q.txt")
s = f.readline()

pattern = r'(0|[6-9]+[67890]*)([-*](0|[6-9]+[67890]*))+'
mx = 0

for i in finditer(pattern, s):
    res = i.group()
    mx = max(mx, len(res))
print(mx)
# 154
'''

# 5
'''
from re import *
f = open("Файлы к задачам/24_2__6jwgo.txt")
s = f.readline()

pattern = r'(0|[7-9][7890]*)([-*](0|[7-9][7890]*))+'
mx = 0
ans = 0

for i in finditer(pattern, s):
    res = i.group()
    if mx < len(res):
        mx = len(res)
        ans = eval(res)

print(abs(ans))

pattern = r'B[1-9]+([+*][1-9]+){1, 49}'
'''

# 6
'''
---------------------------------------------------------------------------------------------------
Текстовый файл состоит из символов A, B, C, D и E.
Определите в прилагаемом файле максимальное количество идущих подряд троек
символов, удовлетворяющих виду: согласная буква + гласная буква + согласная буква.
---------------------------------------------------------------------------------------------------

from re import *

f = open("24dtwwe.txt")
s = f.readline()

pattern = r'([BCD][AE][BCD])+'
mx = 0

for i in finditer(pattern, s):
    t = i.group()
    mx = max(mx, len(t))
print(mx//3)
'''

# 7
'''
---------------------------------------------------------------------------------------------------
Текстовый файл 24-1.txt состоит не более чем из 10**6 символов и содержит десятичные цифры
от 1 до 9 включительно буквы латинского алфавита A,B,C,D, а также знаки «+» и «-».
Определите максимальное количество символов в непрерывной последовательности,
являющейся корректным арифметическим выражением в десятичной системе счисления.

В этом выражении никакие два знака арифметических операций не стоят рядом,
порядок действий определяется по правилам математики.
Числа в выражении могут быть как положительными, так и отрицательными,
при этом знак «+» не может быть использован в начале выражения для
указания положительности числа, а знак «-» может быть использован в
начале выражения для указания отрицательности числа.

В ответе укажите количество символов в найденном выражении.
---------------------------------------------------------------------------------------------------

from re import *

f = open('24dtwwe.txt')
s = f.readline()

pattern = r'[-]?[1-9]+([+-][1-9]+)+'
mx = 0

for i in finditer(len(s)):
    t = i.group()
    mx = max(mx, len(t))
print(mx)
'''

# 8
'''
---------------------------------------------------------------------------------------------------
Текстовый файл 24-2.txt состоит из цифр от 1 до 4, знаков операций «+» и «*» и
заглавных латинских букв A,B,C,D, E,F.
Определите максимальное количество символов в непрерывной последовательности символов,
состоящей из буквы A, за которой следует корректное арифметическое выражение
с целыми неотрицательными числами в десятичной системе счисления.

В этом выражении знаки операций находятся строго между операндами и
никакие два знака арифметических операций не стоят рядом,
порядок действий определяется по правилам математики.

В ответе укажите количество символов в найденном выражении.
---------------------------------------------------------------------------------------------------

from re import *

f = open('24dtwwe.txt')
s = f.readline()

pattern = r'A[1-4]+([+*][1-4]+)+'
mx = 0

for i in finditer(pattern, s):
    t = i.group()
    mx = max(mx, len(t))
print(mx)
'''

# 9
'''
---------------------------------------------------------------------------------------------------
Дан файл 24-280.txt. Необходимо найти самую длинную подстроку,
начинающуюся на символ C и оканчивающуюся символом D,
и не содержащую других символов C и D.
В ответ запишите длину найденной подстроки.
---------------------------------------------------------------------------------------------------

from re import *
from string import *

f = open('24dtwwe.txt')
s = f.readline()

pattern = r'C[ABEFGHIJKLMNOPQRSTUVWXYZ]*D'

# print(ascii_uppercase) - вывели ABCDEFGHIJKLMNOPQRSTUVWXYZ
mx = 0
for i in finditer(pattern, s):
    t = i.group()
    mx = max(mx, len(t))
print(mx)
'''

# 10
'''
---------------------------------------------------------------------------------------------------
Файл 24-280.txt. Найти самую длинную подстроку,
состоящую из наборов ABCD, последний фрагмент может быть неполным.
В ответ запишите длину найденной строки.
---------------------------------------------------------------------------------------------------

from re import *

f = open('24dtwwe.txt')
s = f.readline()

pattern = r'(ABCD)+(ABCD|ABC|AB|A)*'
mx = 0

for i in finditer(pattern, s):
    t = i.group()
    mx = max(mx, len(t))
print(mx)
'''

# 11
'''
---------------------------------------------------------------------------------------------------
Текстовый файл состоит из цифр 0, 1, 2, 3, 4 и знаков арифметических операций «–» и «+».
Определите максимальное количество символов в непрерывной последовательности,
которая является корректным арифметическим выражением с целыми неотрицательными числами.
В этом выражении никакие два знака арифметических операций не стоят рядом,
в записи чисел отсутствуют незначащие (ведущие) нули и число 0 не имеет знака.
В ответе укажите количество символов.
---------------------------------------------------------------------------------------------------

from re import *

f = open('Файлы к задачам/24_1__7boxw.txt')
s = f.readline()

pattern = r'(0|[1-4][0-4]*)([-+](0|[1-4][0-4]*))+'
mx = 0

for i in finditer(pattern, s):
    t = i.group()
    mx = max(mx, len(t))
print(mx)
# 144
'''

# 12
'''
---------------------------------------------------------------------------------------------------
Текстовый файл состоит из символов A,C,D,F,O.
Определите максимальное количество идущих подряд пар символов вида
согласная + гласная
в прилагаемом файле.
---------------------------------------------------------------------------------------------------

from re import *

f = open('Файлы к задачам/Задание_24__7ajcf.txt')
s = f.readline()
pattern = r'(CA|CO|DA|DO|FA|FO)+'
mx = 0

for i in finditer(pattern, s):
    t = i.group()
    mx = max(mx, len(t))
print(mx//2)
# 95
'''

# 13
'''
---------------------------------------------------------------------------------------------------
Текстовый файл состоит не более чем из 106 символов и содержит только цифры
шестнадцатеричной системы счисления, а также знаки «+» и «*» (сложения и умножения).
Определите максимальное количество символов в непрерывной последовательности,
чьё значение выражения является чётным, которая является корректным арифметическим
выражением с целыми неотрицательными числами, записанными в десятичной системе счисления.

При этом искомая последовательность не должна являться частью другой,
более длинной непрерывной последовательности, которая также является
корректным арифметическим выражением.

В этом выражении никакие два знака арифметических операций не стоят рядом,
в записи чисел отсутствуют незначащие (ведущие) нули.
---------------------------------------------------------------------------------------------------

from re import *

f = open('Файлы к задачам/24_1__6ba3v.txt')
s = f.readline()
pattern = r'(?=((0|[1-9][0-9]*)([+*](0|[1-9][0-9]*))+))'
mx = 0

for i in finditer(pattern, s):
    t = i.group(1)
    if eval(t) % 2 == 0:
        mx = max(mx, len(t))
print(mx)
# 200
'''

# 14
'''
---------------------------------------------------------------------------------------------------
Текстовый файл 24_7.txt состоит из символов, обозначающих знаки «+», «*» и десятичных цифр.

Определите максимальное значение, которое является результатом вычисления
непрерывной последовательности, являющейся корректным арифметическим выражением
с целыми неотрицательными числами, в котором обязательно присутствует операция умножения,
но операция сложения может как присутствовать, так и полностью отсутствовать.

При этом искомая последовательность не должна являться частью другой,
более длинной непрерывной последовательности, которая также является
корректным арифметическим выражением.

В этом выражении никакие два знака арифметических операций не стоят рядом.
В записи чисел отсутствуют незначащие (ведущие) нули и число 0 не имеет знака.

В ответе укажите значение полученного выражения.
---------------------------------------------------------------------------------------------------

from re import *

f = open('Файлы к задачам/24_7__6ao2p.txt')
s = f.readline()
pattern = r'(?=((0|[1-9][0-9]*)([+*](0|[1-9][0-9]*))+))'
mx = 0

for i in finditer(pattern, s):
    t = i.group(1)
    if '*' in t:
        mx = max(mx, eval(t))
print(mx)
# 21845377589406941406424045870280528538916509558058704434454291
'''


'''---------------------------------------------------------------------------------------------------------------------'''
'''https://3.shkolkovo.online/my/course/7259/dz/29319'''

# 1
# from re import *
# f = open("Файлы к задачам/24__928qo.txt")
# s = f.readline()
#
# pattern = r'[^TAEIOUY]*([T][^TAEIOUY]*){63}[AEIOUY]'
#
# mn = 10**30
# for i in finditer(pattern, s):
#     g = i.group(0)
#     if mn > len(g):
#         mn = len(g)
#         mn_s = g
# print(mn)
# # 112

'''---------------------------------------------------------------------------------------------------------------------'''

# 2
# from re import *
# f = open("Файлы к задачам/24__8raj2.txt")
# s = f.readline()
#
# pattern = r'([AO][AO][CDF][AO][AO][CDF][AO][AO][CDF][AO][AO][CDF])'
#
# mx = 0
# for i in finditer(pattern, s):
#     g = i.group(0)
#     print(g)
# # 4

'''---------------------------------------------------------------------------------------------------------------------'''

# 3
# from re import *
# f = open("Файлы к задачам/24-7__8ag28.txt")
# s = f.readline()
#
# pattern = r'(?=([K9][^A-JZa-z]*([Z][^A-JZa-z]*){27}[Z]))'
#
# mn = 10**15
# for i in finditer(pattern, s):
#     g = i.group(1)
#     if mn > len(g):
#         mn = len(g)
#         mn_s = g
# print(mn)
# 990

'''---------------------------------------------------------------------------------------------------------------------'''

# 4
# from re import *
# f = open("Файлы к задачам/24_3__6ao05.txt")
# s = f.readline()
#
# pattern = r'(?=(AB(0|[12][012]*)([*+](0|[12][012]*))+))'
#
# for i in finditer(pattern, s):
#     g = i.group(1)
#     print(g)
# 5

# for i in range(len(s) - 1):
#     if s[i:i+2] == 'AB':
#         for k in range(i + 2, len(s)):
#             if s[k] not in '012+*':
#                 print(s[i:k+1])
#                 break

'''---------------------------------------------------------------------------------------------------------------------'''

# 5
# from re import *
# f = open("Файлы к задачам/24_2__6anzj.txt")
# s = f.readline()
#
# pattern = r'(?=((0|[1-7][0-7]*)([+*](0|[1-7][0-7]*))+))'
#
# mx = 0
#
# for i in finditer(pattern, s):
#     g = i.group(1)
#     mx = max(mx, len(g))
# print(mx)
# # 18

'''---------------------------------------------------------------------------------------------------------------------'''

# 6
# from re import *
# f = open("Файлы к задачам/demo_2025_24__7ae4q.txt")
# s = f.readline()
#
# pattern = r'(?=((0|[6-9][06-9]*)([-*](0|[6-9][06-9]*))+))'
#
# mx = 0
# for i in finditer(pattern, s):
#     g = i.group(1)
#     mx = max(mx, len(g))
# print(mx)
# # 154

'''---------------------------------------------------------------------------------------------------------------------'''
'''https://3.shkolkovo.online/my/course/7259/dz/31900'''

# 1
# from re import *
# f = open("Файлы к задачам/24__a5mjz.txt")
# s = f.readline()
# pattern = r'(0[^0123456789]+0)|(2[^0123456789]+2)|(4[^0123456789]+4)|(6[^0123456789]+6)|(8[^0123456789]+8)'
# gl = 'AEIOUY'
#
# ls = []
# for i in finditer(pattern, s):
#     g = i.group(0)
#     gas = sum(1 for el in g if el in gl)
#     cogls = sum(1 for el in g if el not in gl and el not in '0123456789')
#     if gas == cogls:
#         if len(g) == 8:
#             print(g)
#
# p1 = search('4OUKKZE4', s)
# p2 = search('8IZZUTA8', s)
# p3 = search('0YOTOZZ0', s)
# print(p1, p2, p3, sep='\n')
# # 3613619

'''---------------------------------------------------------------------------------------------------------------------'''

# 2
# from re import *
# f = open("Файлы к задачам/24__8wpa1.txt")
# s = f.readline()
#
# num = r'(0|[1-7]+[0-7]*)'
# pattern = fr'(?=({num}([*]{num})*([-]{num})*))'
#
# mxl = 0
# for i in finditer(pattern, s):
#     g = i.group(1)
#     mxl = max(mxl, len(g))
#
# print(mxl)
# # 71

'''---------------------------------------------------------------------------------------------------------------------'''

# 3
# from re import *
# f = open("Файлы к задачам/24__8rakh.txt")
# s = f.readline()
#
# pattern = r'([CDF][CDF][AO])+'
#
# mxl = 0
# for i in finditer(pattern, s):
#     g = i.group(0)
#     mxl = max(mxl, len(g)//3)
#
# print(mxl)
# # 5

'''---------------------------------------------------------------------------------------------------------------------'''

# 4
# from re import *
# f = open("Файлы к задачам/24-7__8ag28.txt")
# s = f.readline()
#
# pattern = r'(K[^A-Ja-z]+|9[^A-Ja-z]+)'
#
# for i in finditer(pattern, s):
#     g = i.group(0)
#     if g.count('Z') == 28:
#         print(len(g), g)
# print(1001 - 4 - 7)
# # 990

'''---------------------------------------------------------------------------------------------------------------------'''

# 5
# from re import *
# f = open('Файлы к задачам/24__7h51q.txt')
# s = f.readline()
#
# pattern = r'(?=(A(0|[123456]+[0123456]*)([-*](0|[123456]+[0123456]*))+))'
#
# mxl = 0
# for i in finditer(pattern, s):
#     g = i.group(1)
#     mxl = max(mxl, len(g))
# print(mxl)
# # 85


'''---------------------------------------------------------------------------------------------------------------------'''
'''https://3.shkolkovo.online/my/course/7259/dz/29318'''

# 1
# from re import *
# f = open("Файлы к задачам/10__19jzu.txt")
# s = f.readline()
#
# pattern = r'(?=((CD)+))'
# mx = 0
#
# for i in finditer(pattern, s):
#     g = i.group(1)
#     mx = max(mx, len(g))
#     if len(g) == 6:
#         print(g)
# print(mx)
# # 6 CDCDCD


# 2
# from re import *
# f = open("Файлы к задачам/1__1iafg.txt")
# s = f.readline()
#
# pattern = r'(?=((AAC|BBC)+))'
# mx = 0
#
# for i in finditer(pattern, s):
#     g = i.group(1)
#     mx = max(mx, len(g))
#     if len(g) == 12:
#         print(g.count('BBC'), g.count('AAC'))
# # 4


# 6
# from re import *
# f = open("Файлы к задачам/Задание_24__7ajcf.txt")
# s = f.readline()
#
# pattern = r'([CDF][AO])+'
# mx = 0
# for i in finditer(pattern, s):
#     g = i.group(0)
#     mx = max(mx, len(g))
# print(mx//2)
# # 95


# 7
# from re import *
# f = open("Файлы к задачам/24_1__7boxw.txt")
# s = f.readline()
#
# pattern = r'(?=((0|[1-4][0-4]*)([-+](0|[1-4][0-4]*))+))'
# mx = 0
# for i in finditer(pattern, s):
#     g = i.group(1)
#     mx = max(mx, len(g))
# print(mx)
# # 144


# 8
# from re import *
# f = open("Файлы к задачам/24__7h51q.txt")
# s = f.readline()
#
# pattern = r'(?=(A([1-6]+([-*][1-6]+)+)))'
# mx = 0
# for i in finditer(pattern, s):
#     g = i.group(1)
#     mx = max(mx, len(g))
# print(mx)
# # 85