"""
Конспект по вебу: https://3.shkolkovo.online/my/course/7259/materials/lesson/36568
+ дз: https://3.shkolkovo.online/my/course/7259/dz/27118"""

# 1
'''
---------------------------------------------------------------------------------------------------
Сеть задана IP-адресом узла 113.116.181.173 и маской сети 255.255.255.128.
Сколько в этой сети IP-адресов, которые оканчиваются на четыре одинаковых бита?
---------------------------------------------------------------------------------------------------

from ipaddress import *

net = ip_network('113.116.181.173/255.255.255.128', 0)
c = 0

for i in net:
    adr = bin(int(i))[2:].zfill(32)
    adr_end = adr[-4:]
    if adr_end in ['0000', '1111']:
        c += 1
print(c)
# 16
'''

# 2
'''
---------------------------------------------------------------------------------------------------
Сеть задана IP-адресом узла 142.206.189.107 и сетевой маской 255.255.192.0.
Сколько в этой сети IP-адресов, для которых количество единиц в двоичной записи IP-адреса кратно 3,
а сами адреса в двоичном виде заканчиваются на 1010?
---------------------------------------------------------------------------------------------------

from ipaddress import *

net = ip_network('142.206.189.107/255.255.192.0', 0)

c = 0
for i in net:
    adr = bin(int(i))[2:].zfill(32)
    if adr.count('1') % 3 == 0:
        if adr[-4:] == '1010':
            c += 1
print(c)
# 341
'''

# 3
'''
---------------------------------------------------------------------------------------------------
Сеть задана IP-адресом 44.249.80.224 и маской сети 255.255.255.252.
Сколько в этой сети узлов, для которых количество единиц в двоичной записи IP-адреса больше 14?
---------------------------------------------------------------------------------------------------

from ipaddress import *

net = ip_network('44.249.80.224/255.255.255.252', 0)
c = 0

for i in net.hosts():
    adr = bin(int(i))[2:].zfill(32)
    if adr.count('1') > 14:
        c += 1
print(c)
# 2
'''

# 4
'''
---------------------------------------------------------------------------------------------------
Определите номер компьютера в сети, если маска подсети равна 255.255.255.248 и
IP-адрес компьютера в сети 108.23.252.178
---------------------------------------------------------------------------------------------------

from ipaddress import *

net = ip_network('108.23.252.178/255.255.255.248', 0)
ip = ip_address('108.23.252.178')
print(int(ip) - int(net.network_address))
# 2
'''

# 5
'''
---------------------------------------------------------------------------------------------------
Определите номер компьютера в сети, если маска подсети равна 255.255.248.0 и
IP-адрес компьютера в сети 17.100.13.33.
---------------------------------------------------------------------------------------------------

from ipaddress import *

net = ip_network('17.100.13.33/255.255.248.0', 0)
ip = ip_address('17.100.13.33')
num = int(ip) - int(net.network_address)
print(num)
# 1313
'''


# 6
'''
---------------------------------------------------------------------------------------------------
По заданным IP-адресу и маске определите адрес сети:
IP-адрес: 183.228.100.169 Маска: 255.240.0.0
В ответе укажите полный адрес сети в десятичной системе счисления (без точек).
---------------------------------------------------------------------------------------------------
from ipaddress import *

net = ip_network("183.228.100.169/255.240.0.0", 0)
adr = str(net.network_address)

print(adr.replace(".", ""))
# 18322400
'''